{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, 3, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 5000, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "RMSprop", "config": {"learning_rate": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07}}, "loss": "mse", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of96.bin", "group1-shard2of96.bin", "group1-shard3of96.bin", "group1-shard4of96.bin", "group1-shard5of96.bin", "group1-shard6of96.bin", "group1-shard7of96.bin", "group1-shard8of96.bin", "group1-shard9of96.bin", "group1-shard10of96.bin", "group1-shard11of96.bin", "group1-shard12of96.bin", "group1-shard13of96.bin", "group1-shard14of96.bin", "group1-shard15of96.bin", "group1-shard16of96.bin", "group1-shard17of96.bin", "group1-shard18of96.bin", "group1-shard19of96.bin", "group1-shard20of96.bin", "group1-shard21of96.bin", "group1-shard22of96.bin", "group1-shard23of96.bin", "group1-shard24of96.bin", "group1-shard25of96.bin", "group1-shard26of96.bin", "group1-shard27of96.bin", "group1-shard28of96.bin", "group1-shard29of96.bin", "group1-shard30of96.bin", "group1-shard31of96.bin", "group1-shard32of96.bin", "group1-shard33of96.bin", "group1-shard34of96.bin", "group1-shard35of96.bin", "group1-shard36of96.bin", "group1-shard37of96.bin", "group1-shard38of96.bin", "group1-shard39of96.bin", "group1-shard40of96.bin", "group1-shard41of96.bin", "group1-shard42of96.bin", "group1-shard43of96.bin", "group1-shard44of96.bin", "group1-shard45of96.bin", "group1-shard46of96.bin", "group1-shard47of96.bin", "group1-shard48of96.bin", "group1-shard49of96.bin", "group1-shard50of96.bin", "group1-shard51of96.bin", "group1-shard52of96.bin", "group1-shard53of96.bin", "group1-shard54of96.bin", "group1-shard55of96.bin", "group1-shard56of96.bin", "group1-shard57of96.bin", "group1-shard58of96.bin", "group1-shard59of96.bin", "group1-shard60of96.bin", "group1-shard61of96.bin", "group1-shard62of96.bin", "group1-shard63of96.bin", "group1-shard64of96.bin", "group1-shard65of96.bin", "group1-shard66of96.bin", "group1-shard67of96.bin", "group1-shard68of96.bin", "group1-shard69of96.bin", "group1-shard70of96.bin", "group1-shard71of96.bin", "group1-shard72of96.bin", "group1-shard73of96.bin", "group1-shard74of96.bin", "group1-shard75of96.bin", "group1-shard76of96.bin", "group1-shard77of96.bin", "group1-shard78of96.bin", "group1-shard79of96.bin", "group1-shard80of96.bin", "group1-shard81of96.bin", "group1-shard82of96.bin", "group1-shard83of96.bin", "group1-shard84of96.bin", "group1-shard85of96.bin", "group1-shard86of96.bin", "group1-shard87of96.bin", "group1-shard88of96.bin", "group1-shard89of96.bin", "group1-shard90of96.bin", "group1-shard91of96.bin", "group1-shard92of96.bin", "group1-shard93of96.bin", "group1-shard94of96.bin", "group1-shard95of96.bin", "group1-shard96of96.bin"], "weights": [{"name": "dense_1/kernel", "shape": [5000, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "lstm_1/kernel", "shape": [1, 20000], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [5000, 20000], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [20000], "dtype": "float32"}]}]}